#Использовать asserts
#Использовать ".."
#Использовать "."

&ТестовыйНабор
Процедура ПриСозданииОбъекта() Экспорт
КонецПроцедуры

&Тест
Процедура ТестПарсингаВложенныхОбъектовВМассиве() Экспорт
    // Дано
    СодержимоеФайла = ТестовыеУтилиты.ПрочитатьТекстФайла(ТестовыеУтилиты.ПолучитьПутьКТестовымДанным("nested_array_object.yaml"));
    ЧтениеYaml = ТестовыеУтилиты.СоздатьЭкземплярПарсера();
    
    // Когда
    Результат = ЧтениеYaml.ПрочитатьYaml(СодержимоеФайла);
    
    // Тогда
    Ожидаем.Что(Результат).Не_().ЭтоНеопределено();
    
    Volumes = Результат.Получить("volumes");
    Ожидаем.Что(Volumes).Не_().ЭтоНеопределено();
    Ожидаем.Что(Volumes.Количество()).Равно(3);
    
    // Первый элемент должен быть соответствием с вложенной структурой
    ПервыйЭлемент = Volumes[0];
    Ожидаем.Что(ТипЗнч(ПервыйЭлемент)).Равно(Тип("Соответствие"));
    
    SonarrConfig = ПервыйЭлемент.Получить("sonarr_config");
    Ожидаем.Что(SonarrConfig).Не_().ЭтоНеопределено();
    Ожидаем.Что(ТипЗнч(SonarrConfig)).Равно(Тип("Соответствие"));
    Ожидаем.Что(SonarrConfig.Получить("test")).Равно("/config");
    Ожидаем.Что(SonarrConfig.Получить("test2")).Равно("/downloads");
    
    // Второй и третий элементы должны быть строками
    Ожидаем.Что(Volumes[1]).Равно("media:/plex_media");
    Ожидаем.Что(Volumes[2]).Равно("transmission_download:/downloads");
КонецПроцедуры
